blog/app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)
    if @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?)  [["title", "123"], ["body", "12213131231"], ["created_at", "2023-04-19 13:33:12.920012"], ["updated_at", "2023-04-19 13:33:12.920012"], ["status", "public"]]

  def update
    @article = Article.find(params[:id])
    if @article.update(article_params)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "Hello Rails"], ["body", "I am on Railings!"], ["updated_at", "2023-04-18 11:12:26.133146"], ["id", 2]]