blog/app/controllers/articles_controller.rb

  def show
    @article = Article.find(params[:id])
    @comments = @article.comments.paginate(page: params[:page], per_page: 10)
---
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 1]]