blog/app/controllers/comments_controller.rb

    def create
        @article = Article.find(params[:article_id])
        @comment = @article.comments.create(comment_params)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?, ?)  [["commenter", "1"], ["body", "222222222222222"], ["article_id", 10], ["created_at", "2023-04-19 11:44:41.974460"], ["updated_at", "2023-04-19 11:44:41.974460"], ["status", "public"]]